## Advanced Pandas

In [53]:
import pandas as pd
import numpy as np

In [54]:
pd.set_option('display.max_rows', None)  # Show all rows
pd.set_option('display.max_columns', None)  # Show all columns
pd.set_option('display.width', None)  # Disable line wrapping
pd.set_option('display.max_colwidth', None)  # Show full column width
pd.set_option('display.float_format', '{:.6f}'.format)  # To display floats without scientific notation

- Read CSV file

In [55]:
data = pd.read_csv('startup_funding.csv', thousands=',')
data.head()

,SNo,Date,StartupName,IndustryVertical,SubVertical,CityLocation,InvestorsName,InvestmentType,AmountInUSD,Remarks
0,0,01/08/2017,TouchKin,Technology,Predictive Care Platform,Bangalore,Kae Capital,Private Equity,1300000.000000,NaN
1,1,02/08/2017,Ethinos,Technology,Digital Marketing Agency,Mumbai,Triton Investment Advisors,Private Equity,NaN,NaN
2,2,02/08/2017,Leverage Edu,Consumer Internet,Online platform for Higher Education Services,New Delhi,"Kashyap Deorah, Anand Sankeshwar, Deepak Jain, Sadashiva NT, Arjun Mehta, Satish Kaul, Anindya Ghose",Seed Funding,NaN,NaN
3,3,02/08/2017,Zepo,Consumer Internet,DIY Ecommerce platform,Mumbai,"Kunal Shah, LetsVenture, Anupam Mittal, Hetal Sonpal",Seed Funding,500000.000000,NaN
4,4,02/08/2017,Click2Clinic,Consumer Internet,healthcare service aggregator,Hyderabad,"Narottam Thudi, Shireesh Palle",Seed Funding,850000.000000,NaN

In [56]:
data.shape

(2372, 10)

In [57]:
data.describe()

              SNo       AmountInUSD
count 2372.000000       1525.000000
mean  1185.500000   12031073.099016
std    684.881742   64031175.128736
min      0.000000      16000.000000
25%    592.750000     370000.000000
50%   1185.500000    1070000.000000
75%   1778.250000    6000000.000000
max   2371.000000 1400000000.000000

## Making a Copy of Data

It is important to make a copy of data first, as in future if we corrupt the df by accident then we must have a copy to read data.

In [58]:
# this copy() method made a seperate copy
df = data.copy()

In [59]:
# it point out the data
# they both are same - its just like a pointer
df1 = data

## Basic Data Explortion

#### Getting Shape of Data

In [60]:
df.shape

(2372, 10)

#### Getting a list of all columns in dataframe

In [61]:
df.columns

Index(['SNo', 'Date', 'StartupName', 'IndustryVertical', 'SubVertical',
       'CityLocation', 'InvestorsName', 'InvestmentType', 'AmountInUSD',
       'Remarks'],
      dtype='object')

#### Checking data types of all columns

In [62]:
df.dtypes

SNo                   int64
Date                 object
StartupName          object
IndustryVertical     object
SubVertical          object
CityLocation         object
InvestorsName        object
InvestmentType       object
AmountInUSD         float64
Remarks              object
dtype: object

#### Getting Top/Bottom 5 Values

In [63]:
df.head(2)

,SNo,Date,StartupName,IndustryVertical,SubVertical,CityLocation,InvestorsName,InvestmentType,AmountInUSD,Remarks
0,0,01/08/2017,TouchKin,Technology,Predictive Care Platform,Bangalore,Kae Capital,Private Equity,1300000.000000,NaN
1,1,02/08/2017,Ethinos,Technology,Digital Marketing Agency,Mumbai,Triton Investment Advisors,Private Equity,NaN,NaN

In [64]:
df.tail(2)

,SNo,Date,StartupName,IndustryVertical,SubVertical,CityLocation,InvestorsName,InvestmentType,AmountInUSD,Remarks
2370,2370,30/01/2015,Simplotel,NaN,NaN,NaN,MakeMyTrip,Private Equity,NaN,"Strategic Funding, Minority stake"
2371,2371,31/01/2015,couponmachine.in,NaN,NaN,NaN,UK based Group of Angel Investors,Seed Funding,140000.000000,NaN

#### Getting Summary of all columns

In [65]:
df.describe()

              SNo       AmountInUSD
count 2372.000000       1525.000000
mean  1185.500000   12031073.099016
std    684.881742   64031175.128736
min      0.000000      16000.000000
25%    592.750000     370000.000000
50%   1185.500000    1070000.000000
75%   1778.250000    6000000.000000
max   2371.000000 1400000000.000000

In [66]:
# display the basic stats of object type
df.describe(include='O')

,Date,StartupName,IndustryVertical,SubVertical,CityLocation,InvestorsName,InvestmentType,Remarks
count,2372,2372,2201,1436,2193,2364,2371,419
unique,701,2001,743,1364,71,1885,7,69
top,02/02/2015,Swiggy,Consumer Internet,Online Pharmacy,Bangalore,Undisclosed Investors,Seed Funding,Series A
freq,11,7,772,9,627,33,1271,177

In [67]:
# display all the column stats
df.describe(include='all')

,SNo,Date,StartupName,IndustryVertical,SubVertical,CityLocation,InvestorsName,InvestmentType,AmountInUSD,Remarks
count,2372.000000,2372,2372,2201,1436,2193,2364,2371,1525.000000,419
unique,NaN,701,2001,743,1364,71,1885,7,NaN,69
top,NaN,02/02/2015,Swiggy,Consumer Internet,Online Pharmacy,Bangalore,Undisclosed Investors,Seed Funding,NaN,Series A
freq,NaN,11,7,772,9,627,33,1271,NaN,177
mean,1185.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,12031073.099016,NaN
std,684.881742,NaN,NaN,NaN,NaN,NaN,NaN,NaN,64031175.128736,NaN
min,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,16000.000000,NaN
25%,592.750000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,370000.000000,NaN
50%,1185.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1070000.000000,NaN
75%,1778.250000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6000000.000000,NaN
max,2371.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1400000000.000000,NaN

#### Getting Unique values of single column

In [68]:
df['InvestmentType'].nunique() # returns numbers of unique values

7

In [69]:
df['InvestmentType'].unique()

array(['Private Equity', 'Seed Funding', 'Debt Funding', nan,
       'SeedFunding', 'PrivateEquity', 'Crowd funding', 'Crowd Funding'],
      dtype=object)

In [70]:
df['InvestmentType'].value_counts()

InvestmentType
Seed Funding      1271
Private Equity    1066
SeedFunding         30
Debt Funding         1
PrivateEquity        1
Crowd funding        1
Crowd Funding        1
Name: count, dtype: int64

#### Missing Values

Checking which columns have missing values

In [71]:
df.isnull().sum()

SNo                    0
Date                   0
StartupName            0
IndustryVertical     171
SubVertical          936
CityLocation         179
InvestorsName          8
InvestmentType         1
AmountInUSD          847
Remarks             1953
dtype: int64

- Filling missing values

In [72]:
df.head(3)

,SNo,Date,StartupName,IndustryVertical,SubVertical,CityLocation,InvestorsName,InvestmentType,AmountInUSD,Remarks
0,0,01/08/2017,TouchKin,Technology,Predictive Care Platform,Bangalore,Kae Capital,Private Equity,1300000.000000,NaN
1,1,02/08/2017,Ethinos,Technology,Digital Marketing Agency,Mumbai,Triton Investment Advisors,Private Equity,NaN,NaN
2,2,02/08/2017,Leverage Edu,Consumer Internet,Online platform for Higher Education Services,New Delhi,"Kashyap Deorah, Anand Sankeshwar, Deepak Jain, Sadashiva NT, Arjun Mehta, Satish Kaul, Anindya Ghose",Seed Funding,NaN,NaN

In [73]:
# fill missing values
# df.fillna(0, inplace=True)

In [74]:
df['AmountInUSD'].fillna(0, inplace=True)

C:\Users\khan\AppData\Local\Temp\ipykernel_18596\2582305221.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['AmountInUSD'].fillna(0, inplace=True)

In [75]:
df.head(3)

,SNo,Date,StartupName,IndustryVertical,SubVertical,CityLocation,InvestorsName,InvestmentType,AmountInUSD,Remarks
0,0,01/08/2017,TouchKin,Technology,Predictive Care Platform,Bangalore,Kae Capital,Private Equity,1300000.000000,NaN
1,1,02/08/2017,Ethinos,Technology,Digital Marketing Agency,Mumbai,Triton Investment Advisors,Private Equity,0.000000,NaN
2,2,02/08/2017,Leverage Edu,Consumer Internet,Online platform for Higher Education Services,New Delhi,"Kashyap Deorah, Anand Sankeshwar, Deepak Jain, Sadashiva NT, Arjun Mehta, Satish Kaul, Anindya Ghose",Seed Funding,0.000000,NaN

#### Treating all missing values at once

In [76]:
# simply give Others argument and it will fill all the missing values
df.fillna('Others', inplace=True)

In [77]:
df.isnull().sum()

SNo                 0
Date                0
StartupName         0
IndustryVertical    0
SubVertical         0
CityLocation        0
InvestorsName       0
InvestmentType      0
AmountInUSD         0
Remarks             0
dtype: int64

### Duplicates

`duplicated()` returned the duplicated values and `sum()` count all the duplicated values

In [78]:
df['StartupName'].duplicated().sum()

371

In [80]:
df[df['StartupName'] == 'Ola']

,SNo,Date,StartupName,IndustryVertical,SubVertical,CityLocation,InvestorsName,InvestmentType,AmountInUSD,Remarks
76,76,14/06/2017,Ola,Consumer Internet,Cab Aggregation App,Bangalore,Tekne Capital Management LLC,Private Equity,50000000.000000,Others
119,119,03/05/2017,Ola,Consumer Internet,Cab Aggregation App,Bangalore,"Falcon Edge Capital, Capital Advisers",Private Equity,104500000.000000,Others
252,252,01/03/2017,Ola,Consumer Internet,App based cab aggregator,Bangalore,SoftBank Group Corp,Private Equity,330000000.000000,Others
1572,1572,18/11/2015,Ola,Car Aggregator & Retail Mobile App,Others,Bangalore,"Baillie Gifford, Falcon Edge Capital, Tiger Global, SoftBank Group, DST Global, Didi Kuaidi",Private Equity,500000000.000000,Series F ( More Details Here)

In [81]:
# display all the duplicated rows
# df[df['StartupName'].duplicated()]

### Checking for whole row duplicates

In [85]:
df[df.duplicated()]

Empty DataFrame
Columns: [SNo, Date, StartupName, IndustryVertical, SubVertical, CityLocation, InvestorsName, InvestmentType, AmountInUSD, Remarks]
Index: []

#### Deleting Duplicates from specific column

In [86]:
df.shape

(2372, 10)

In [87]:
df.drop_duplicates(['StartupName'], keep='first').shape # default is first

(2001, 10)

In [88]:
df.drop_duplicates(['StartupName'], keep='last').shape # keeps the last instance and delete the rest

(2001, 10)

In [89]:
df.drop_duplicates(['StartupName'], keep=False).shape # deletes all the occurences of duplicates so none is left

(1720, 10)

### Delete whole row duplicates

In [90]:
# deletes whole row duplicates
df.drop_duplicates().shape

(2372, 10)

In [91]:
df.shape

(2372, 10)

- Now we will use inplace=True to save the dataframe

In [92]:
df.drop_duplicates(inplace=True)
df.shape

(2372, 10)

### Selecting / Dropping Columns

- **Selecting Columns**

In [94]:
df[['Date','CityLocation', 'AmountInUSD']]

- **Dropping Columns**

In [101]:
df['index'] = 999

In [102]:
df.columns

Index(['SNo', 'Date', 'StartupName', 'IndustryVertical', 'SubVertical',
       'CityLocation', 'InvestorsName', 'InvestmentType', 'AmountInUSD',
       'Remarks', 'index'],
      dtype='object')

In [103]:
df.drop('index', axis=1, inplace=True)

In [104]:
df.columns

Index(['SNo', 'Date', 'StartupName', 'IndustryVertical', 'SubVertical',
       'CityLocation', 'InvestorsName', 'InvestmentType', 'AmountInUSD',
       'Remarks'],
      dtype='object')

### String Operations on Whole Columns

In [105]:
df['InvestmentType'].unique()

array(['Private Equity', 'Seed Funding', 'Debt Funding', 'Others',
       'SeedFunding', 'PrivateEquity', 'Crowd funding', 'Crowd Funding'],
      dtype=object)

- **String Replacement**

In [106]:
# first parameter in str.replace is one which we want to replace and
# the second one is with which we are replacing it
df['InvestmentType'].replace('PrivateEquity', 'Private Equity').unique()

array(['Private Equity', 'Seed Funding', 'Debt Funding', 'Others',
       'SeedFunding', 'Crowd funding', 'Crowd Funding'], dtype=object)

In [107]:
df['InvestmentType'].unique()

array(['Private Equity', 'Seed Funding', 'Debt Funding', 'Others',
       'SeedFunding', 'PrivateEquity', 'Crowd funding', 'Crowd Funding'],
      dtype=object)

In [109]:
df['InvestmentType'] = df['InvestmentType'].replace('PrivateEquity', 'Private Equity')

In [110]:
df['InvestmentType'].unique()

array(['Private Equity', 'Seed Funding', 'Debt Funding', 'Others',
       'SeedFunding', 'Crowd funding', 'Crowd Funding'], dtype=object)

In [112]:
df['InvestmentType'] = df['InvestmentType'].replace('SeedFunding', 'Seed Funding')
df['InvestmentType'] = df['InvestmentType'].replace('Crowd funding', 'Crowd Funding')

In [113]:
df['InvestmentType'].unique()

array(['Private Equity', 'Seed Funding', 'Debt Funding', 'Others',
       'Crowd Funding'], dtype=object)

### Capitalization

In [116]:
df['CityLocation'].value_counts()
df['CityLocation'].unique()

array(['Bangalore', 'Mumbai', 'New Delhi', 'Hyderabad', 'Ahmedabad',
       'Gurgaon', 'Noida', 'Pune', 'Kolkata', 'bangalore', 'Trivandrum',
       'Chennai', 'Chandigarh', 'Jaipur', 'Vadodara', 'Surat',
       'Missourie', 'Panaji', 'Gwalior', 'Karur', 'Udupi', 'Kochi',
       'Indore', 'Singapore', 'Goa', 'Agra', 'Bangalore/ Bangkok',
       'Hubli', 'Delhi', 'Kerala', 'Kozhikode', 'US', 'Coimbatore',
       'Siliguri', 'Others', 'USA', 'Lucknow', 'Kanpur',
       'SFO / Bangalore', 'London', 'Seattle / Bangalore', 'Pune/Seattle',
       'Pune / Dubai', 'Bangalore / SFO', 'Varanasi', 'Bhopal',
       'New Delhi / US', 'Mumbai / UK', 'Jodhpur', 'Hyderabad/USA',
       'Boston', 'Bangalore / Palo Alto', 'Mumbai / NY', 'USA/India',
       'Goa/Hyderabad', 'Noida / Singapore', 'Belgaum', 'Pune / US',
       'Chennai/ Singapore', 'Pune / Singapore', 'Bangalore / San Mateo',
       'New York/ India', 'US/India', 'Gurgaon / SFO', 'Bangalore / USA',
       'New Delhi/ Houston', 'Nagpur', 'Mumbai / Global', 'India / US',
       'Udaipur', 'New Delhi / California', 'Dallas / Hyderabad'],
      dtype=object)

In [119]:
df['CityLocation'].str.upper()
df['CityLocation'].str.lower()
df['CityLocation'].str.title()
df['CityLocation'] = df['CityLocation'].str.title() # save to dataframe

In [121]:
df.head(2)

,SNo,Date,StartupName,IndustryVertical,SubVertical,CityLocation,InvestorsName,InvestmentType,AmountInUSD,Remarks
0,0,01/08/2017,TouchKin,Technology,Predictive Care Platform,Bangalore,Kae Capital,Private Equity,1300000.000000,Others
1,1,02/08/2017,Ethinos,Technology,Digital Marketing Agency,Mumbai,Triton Investment Advisors,Private Equity,0.000000,Others

### Checking if there is a substring in each column value

In [123]:
s = 'Dice'
s.find('ice')

1

In [127]:
df['InvestorsName'].str.contains('Khan').value_counts()

InvestorsName
False    2361
True       11
Name: count, dtype: int64

In [125]:
df[df['InvestorsName'].str.contains('Khan')]

,SNo,Date,StartupName,IndustryVertical,SubVertical,CityLocation,InvestorsName,InvestmentType,AmountInUSD,Remarks
81,81,16/06/2017,Fincash,Consumer Internet,Personal Finance platform,Mumbai,"Mohammed Khan, Sameer Narayan & Others",Seed Funding,100000.000000,Others
780,780,17/08/2016,MaalGaadi,Logistics,Online Logistics Marketplace,Indore,"Swan Angel Network,Sachin Khandelwal and others",Seed Funding,375000.000000,Others
871,871,15/07/2016,BaggOut,eCommerce,Women’s Fashion etailer,New Delhi,"Sumit Jain, Sumit Jain, Anurag Gupta, Varun Khanna, Faraz Khan",Seed Funding,0.000000,Others
920,920,10/06/2016,Kickstart Jobs,Technology,Entry level hiring platform,Gurgaon,"Vivek Joshi, Mohit Satyanand, Amit Banati, Arun Khanna",Seed Funding,0.000000,Others
947,947,17/06/2016,BYG,Consumer Internet,Fitness centre Discovery & Booking Mobile app,Bangalore,"Sanjay Verma, Amit Khanna (LetsVenture)",Seed Funding,0.000000,Others
1094,1094,13/04/2016,Legalraasta,Consumer Internet,Online legal Services for Startups,New Delhi,"Pravin Khandelwal, Yatin Kumar Jain",Seed Funding,1000000.000000,Others
1155,1155,03/3/2016,Imarticus Learning,Education,Financial Services & Analytics Education Institute,Mumbai,"Blinc Advisors, Amit Nanavati, Tashwinder Singh, Taranjit Jaswal, Amit Khanna",Private Equity,1000000.000000,Others
1581,1581,19/11/2015,PlaceofOrigin,Online Gourmet Food Marketplace,Others,Bangalore,"S.D. Shibulal, Kris Gopalakrishnan, Srinath Batni, Professor Tarun Khanna, Ganapathy Venugopal.",Seed Funding,0.000000,Others
1598,1598,25/11/2015,Tooler,On Demand Laundry Services App,Others,New Delhi,"Raghu Khanna, Sameer Gupta",Seed Funding,110000.000000,Others
1793,1793,29/09/2015,LoanCircle,Consumer lending marketplace,Others,Bangalore,"Zishaan Hayath, Rahul Khanna & Others",Seed Funding,0.000000,Others
1905,1905,02/07/2015,Zenatix,Internet of Things platform,Others,Gurgaon,"Rajan Anandan, Kunal Bahl, Rohit Bansal, Rahul Khanna",Seed Funding,161000.000000,Others

### Dataframe.at vs Dataframe.loc

In [128]:
df.loc[133, ]

SNo                                      133
Date                              09/05/2017
StartupName                       Curie Labs
IndustryVertical                  Technology
SubVertical         Energy Analytics startup
CityLocation                       New Delhi
InvestorsName                Satoshi Studios
InvestmentType                  Seed Funding
AmountInUSD                     50000.000000
Remarks                               Others
Name: 133, dtype: object

In [129]:
df.loc[133, 'IndustryVertical'] = 'abc'

In [131]:
df.at[133, 'IndustryVertical'] = 'Technology'

In [132]:
df.loc[133]

SNo                                      133
Date                              09/05/2017
StartupName                       Curie Labs
IndustryVertical                  Technology
SubVertical         Energy Analytics startup
CityLocation                       New Delhi
InvestorsName                Satoshi Studios
InvestmentType                  Seed Funding
AmountInUSD                     50000.000000
Remarks                               Others
Name: 133, dtype: object

In [133]:
# replace the value of startup name at row 133
df.at[133, 'StartupName'] = 'Zubair Labs'

In [134]:
df.loc[133]

SNo                                      133
Date                              09/05/2017
StartupName                      Zubair Labs
IndustryVertical                  Technology
SubVertical         Energy Analytics startup
CityLocation                       New Delhi
InvestorsName                Satoshi Studios
InvestmentType                  Seed Funding
AmountInUSD                     50000.000000
Remarks                               Others
Name: 133, dtype: object

In [135]:
# at is fast as compare to loc
%timeit df.at[133, 'StartupName']

11.1 µs ± 3.82 µs per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [137]:
%timeit df.loc[133, 'StartupName']

15.2 µs ± 1.64 µs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

## **Joins**

In [140]:
rows1 = df[0:10]
rows2 = df[5:12]
print(rows1.shape)
rows1
table1 = rows1[['SNo', 'Date', 'CityLocation']]
table2 = rows2[['SNo', 'StartupName', 'IndustryVertical', 'InvestmentType']]
print(table1.shape)
print(table2.shape)
table1

(10, 10)
(10, 3)
(7, 4)

   SNo        Date CityLocation
0    0  01/08/2017    Bangalore
1    1  02/08/2017       Mumbai
2    2  02/08/2017    New Delhi
3    3  02/08/2017       Mumbai
4    4  02/08/2017    Hyderabad
5    5  01/07/2017    Bangalore
6    6  03/07/2017    Ahmedabad
7    7  04/07/2017      Gurgaon
8    8  05/07/2017    Bangalore
9    9  05/07/2017        Noida

- table1 merge with table2 **merge(table, how='right', on='SNo')**
- Most simply, we can explicitly specify the name of the key column using the **on** keyword.
- **how** keyword are **'inner', 'outer', 'left' and 'right'**
- An outer join returns a join over the union of the input columns, and fills in all missing values with NaN

In [141]:
table1.merge(table2, how='right', on='SNo')

,SNo,Date,CityLocation,StartupName,IndustryVertical,InvestmentType
0,5,01/07/2017,Bangalore,Billion Loans,Consumer Internet,Seed Funding
1,6,03/07/2017,Ahmedabad,Ecolibriumenergy,Technology,Private Equity
2,7,04/07/2017,Gurgaon,Droom,eCommerce,Private Equity
3,8,05/07/2017,Bangalore,Jumbotail,eCommerce,Private Equity
4,9,05/07/2017,Noida,Moglix,eCommerce,Private Equity
5,10,NaN,NaN,Timesaverz,Consumer Internet,Private Equity
6,11,NaN,NaN,Minjar,Technology,Seed Funding

### **Sorting**